#ifndef GUARD_POKEMON_H
#define GUARD_POKEMON_H

#include "constants/pokemon.h"
#include "constants/species.h"
#include "sprite.h"
#include "constants/region_map_sections.h"
#include "constants/pokemon_config.h"
#include "constants/map_groups.h"

#define OUTBREAK_NONE               0
#define OUBREAK_LAPRAS_ICEFALL_CAVE 1
#define NUM_OUTBREAKS               OUBREAK_LAPRAS_ICEFALL_CAVE + 1

#define MAX_BEAUTY      255
#define MAX_IVS         31
#define EVENT_LEGAL     1
#define NEW_PERSONALITY 1
#define MON_OBEDIENCE   TRUE

struct BoxPokemon
{
    // Words 1 & 2: PID + Trainer ID
    u32 personality;
    u32 otId;

    // Words 3-5: Pokémon nickname (12 chars)
    u8 nickname[POKEMON_NAME_LENGTH];

    // Word 6: Species + Experience points (used to derive level)
    u32 move1:10;
    u32 experience:21;
    u32 exiolite:1;

    // Words 7 & 8: moves, language, gender, friendship, Pokérus, ppBonuses
    u32 move2:10;
    u32 move3:10;
    u32 pokerus:1;
    u32 isAlpha:1;
    u32 friendship:8;
    u32 seasonCaught:2;

    u32 species:12;
    u32 formId:5;
    u32 move4:10;
    u32 hpType:5; //Will be used for tera type too

    // Words 9 - 11: EV's
    u8 hpEV;
    u8 attackEV;
    u8 defenseEV;
    u8 speedEV;
    u8 spAttackEV;
    u8 spDefenseEV;

    // Word 12: miscellaneous data; item, nature, Egg and origin data
    u32 heldItem:10;
    u32 nature:5;
    u32 isEgg:1;
    u32 metLevel:7;
    u32 pokeball:5; //31 balls
    u32 style:3;
    u32 isShiny:1;

    // Words 13 & 14: Trainer name + met location
    u8 metLocation;
    u8 otName[PLAYER_NAME_LENGTH];

    u8 markings:4;
    u8 abilityNum:2;
    u8 otGender:1;
    u8 isEventMon:1;
};

#define STYLE_BALANCED     0
#define STYLE_DISRUPTOR    1
#define STYLE_TANK         2
#define STYLE_STRIKER      3
#define STYLE_SPEEDSTER    4
#define STYLE_BRUISER      5
#define STYLE_JUGGERNAUT   6
#define STYLE_ALL_ROUNDER  7
#define NUM_STYLES         8

#define STYLE_DISRUPTOR_LEVEL    15
#define STYLE_TANK_LEVEL         23
#define STYLE_STRIKER_LEVEL      31
#define STYLE_SPEEDSTER_LEVEL    39
#define STYLE_BRUISER_LEVEL      47
#define STYLE_JUGGERNAUT_LEVEL   55
#define STYLE_ALL_ROUNDER_LEVEL  63

struct Pokemon
{
    struct BoxPokemon box;
    u8 pp[MAX_MON_MOVES];
    u32 status;
    u8 level;
    u8 mail;
    u16 hp;
    u16 maxHP;
    u16 attack;
    u16 defense;
    u16 speed;
    u16 spAttack;
    u16 spDefense;
};

struct CompressedBattlemon
{
    /* 0x00 */ u16 species;
    /* 0x02 */ u16 heldItem:10;
    /* 0x02 */ u16 nature:5;
    /* 0x02 */ u16 exiolite:1;
    /* 0x04 */ u32 hpIV:5;
    /* 0x04 */ u32 attackIV:5;
    /* 0x04 */ u32 defenseIV:5;
    /* 0x04 */ u32 spAttackIV:5;
    /* 0x04 */ u32 spDefenseIV:5;
    /* 0x04 */ u32 speedIV:5;
    /* 0x04 */ u32 otGender:1;
    /* 0x04 */ u32 shinyness:1;
    /* 0x08 */ u8 hpEV;
    /* 0x09 */ u8 attackEV;
    /* 0x0A */ u8 defenseEV;
    /* 0x0B */ u8 speedEV;
    /* 0x0C */ u8 spAttackEV;
    /* 0x0D */ u8 spDefenseEV;
    /* 0x0E */ u8 level;
    /* 0x0F */ u32 moves1:10;
    /* 0x0F */ u32 moves2:10;
    /* 0x0F */ u32 moves3:10;
    /* 0x0F */ u32 abilityNum:2;
    /* 0x13 */ u16 moves4:10;
    /* 0x13 */ u16 pokeball:5;
    /* 0x13 */ u16 filler:1;
};

struct CompressedPlayerParty
{
    u8 trainerName[PLAYER_NAME_LENGTH + 1];
    struct CompressedBattlemon CompressedParty[PARTY_SIZE];
    u8 trainerGender:1;
    u8 trainerCostume:3;
    u8 redColor:4;
    u8 blueColor:4;
    u8 greenColor:4;
    u8 partySize:3;
    u8 title:5;
};

struct CompressedPokemon
{
    /* 0x00 */ u32 personality;
    /* 0x04 */ u32 otId;
    /* 0x08 */ u8 otName[PLAYER_NAME_LENGTH];
    /* 0x10 */ u16 species:11;
    /* 0x10 */ u16 formId:5;
    /* 0x10 */ u16 heldItem:10;
    /* 0x13 */ u16 nature:5;
    /* 0x10 */ u16 exiolite:1;
    /* 0x14 */ u32 hpIV:5;
    /* 0x14 */ u32 attackIV:5;
    /* 0x14 */ u32 defenseIV:5;
    /* 0x14 */ u32 spAttackIV:5;
    /* 0x14 */ u32 spDefenseIV:5;
    /* 0x14 */ u32 speedIV:5;
    /* 0x14 */ u32 otGender:1;
    /* 0x14 */ u32 unused1:1;
    /* 0x18 */ u8 hpEV;
    /* 0x19 */ u8 attackEV;
    /* 0x1A */ u8 defenseEV;
    /* 0x1B */ u8 speedEV;
    /* 0x1C */ u8 spAttackEV;
    /* 0x1D */ u8 spDefenseEV;
    /* 0x1E */ u8 level:7;
    /* 0x14 */ u8 unused2:1;
    /* 0x1F */ u32 moves1:10;
    /* 0x1F */ u32 moves2:10;
    /* 0x1F */ u32 moves3:10;
    /* 0x1F */ u32 abilityNum:2;
    /* 0x1F */ u16 moves4:10;
    /* 0x12 */ u16 pokeball:5;
    /* 0x1F */ u16 unused3:1;
    /* 0x27 */ 
};

struct Unknown_806F160_Struct
{
    u32 field_0_0:4;
    u32 field_0_1:4;
    u32 field_1:8;
    u16 magic:8;
    u32 field_3_0:4;
    u32 field_3_1:4;
    void *bytes;
    u8 **byteArrays;
    struct SpriteTemplate *templates;
    struct SpriteFrameImage *frameImages;
};

struct BattlePokemon
{
    u16 species:11;
	u16 formId:5;
    u16 attack;
    u16 defense;
    u16 speed;
    u16 spAttack;
    u16 spDefense;
    u16 moves[MAX_MON_MOVES];
    u32 hpIV:5;
    u32 attackIV:5;
    u32 defenseIV:5;
    u32 speedIV:5;
    u32 spAttackIV:5;
    u32 spDefenseIV:5;
    u32 abilityNum:2;
    s8 statStages[NUM_BATTLE_STATS];
    u16 ability;
    u8 type1;
    u8 type2;
    u8 type3;
    u8 pp[MAX_MON_MOVES];
    u16 hp;
    u8 level;
    u8 friendship;
    u16 maxHP;
    u16 item;
    u8 nickname[POKEMON_NAME_LENGTH + 1];
    u8 ppBonuses;
    u8 otName[PLAYER_NAME_LENGTH + 1];
    u32 experience;
    u32 personality;
    u32 status1;
